import React from "react";

export default function () {
  return (
    <div>
      <div className="apa">
        <p>
          {" "}
          Жубайыңа жумшаксың деп досторум, <br />
          Сөз кылышат, мен ал сөздөн коркподум.
          <br />
          Өз аялым, жумшак болсом эмне экен?
          <br />
          Жумшак эмес, мерездиктен коркомун.
          <br />
          Аялым да, демек мага аманат,
          <br />
          Аманатка кылчу беле кыянат.
          <br />
          Ал да айдай, күндөй кызы бирөөнүн,
          <br />
          Ким өз кызын жамандыкка кыя алат?
          <br />
          Керек болсо, мындан дагы жумшарам,
          <br />
          Эң бир бийик, эң бир асыл бул кадам.
          <br />
          Жубайымдын жылмаюусу мен үчүн,
          <br />
          Эң бир кымбат, сен да ошент суранам.
          <br />
          Кара, сага кандай аяш бакырат?
          <br />
          Себеби эмне? ойлоп көрчү жакшылап.
          <br />
          Себеби сен, аялыңа мерезсиң,
          <br />
          Эркекмин деп, көкүрөктү каккылап.
          <br />
          Аялыңа, кол көтөрүп эрдемсип,
          <br />
          Эркекмин деп, мерез болгон тентектик.
          <br />
          Аялыңа сый мамиле, жумшактык,
          <br />
          Мына ушул, ушул накта эркектик.
          <br />
          Аялды сен не максатта аласың?
          <br />
          Аял сага бала төрөп, атасың.
          <br />
          Аял баркын түшүнбөгөн адамдар,
          <br />
          Жөн эле бир ойлоп көрсүн апасын.
        </p>
      </div>
    </div>
  );
}
